{
  "_name_or_path": "RTM_torsion_countinue_v2_epoch12_final_model2/",
  "activation_function": "gelu_new",
  "architectures": [
    "GPT2LMHeadModel"
  ],
  "attn_pdrop": 0.1,
  "bos_token_id": 825,
  "embd_pdrop": 0.1,
  "eos_token_id": 826,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "mask_token_id": 827,
  "model_type": "gpt2",
  "n_ctx": 200,
  "n_embd": 768,
  "n_head": 8,
  "n_inner": null,
  "n_layer": 12,
  "n_positions": 200,
  "pad_token_id": 0,
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.1,
  "scale_attn_by_inverse_layer_idx": false,
  "scale_attn_weights": true,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 200
    }
  },
  "torch_dtype": "float32",
  "transformers_version": "4.24.0",
  "use_cache": true,
  "vocab_size": 836
}
